#Python and Data Analytics Bootcamp
##*Project Submission* 

_***DONE BY SALIHA A S***_

_Data Analytics on Titanic Survival_

####**Impoting pandas using import statement and numpy to apply mathematical functions.**

In [ ]:
import pandas as pd
import numpy as np

->> Using the functions to get the csv file and converting the file to data frame.

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train1.csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
# NO OF ROWS AND COLUMNS
df.shape

(891, 12)

####**HANDLING THE NULL VALUES (ROWS AND COLUMNS WITH NO VALUES)**

EITHER FILL IT OR DROP IT!

In [ ]:

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

####**Storing only the columns with more than 35% of values missing in datasheet**

In [ ]:

ab= df.isnull().sum()
drop_col=ab[ab>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index,axis=1,inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

####**Filling the null value with mean**

In [ ]:
df.fillna(df.mean(), inplace = True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

* Since embarked contains strings mean value is not estimated.

####**Getting the details of "Embarked"**

In [ ]:
 df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

####**Filling the NULL values with the most frequent value of column**

In [ ]:
df['Embarked'].fillna('S', inplace= True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

####**Correlation between columns**
proportionality b/w values of two columns

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

*sibsp* = no. of siblings/ spouses abroad
*parch* = no. of parents/ children abroad

####Making a new column family_size by combining these two columns

In [ ]:
df['FamilySize'] = df['SibSp']+df['Parch']
df.drop(['SibSp', 'Parch'], axis=1, inplace= True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

##### Family Size in the Ship don't have much correlance with survival rate
* Lets check whether a person was alone or not would affect the survival or not

In [ ]:
df['Alone']= [0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0              1         0       3  ...        S          1      0
1              2         1       1  ...        C          1      0
2              3         1       3  ...        S          0      1
3              4         1       1  ...        S          1      0
4              5         0       3  ...        S          0      1
..           ...       ...     ...  ...      ...        ...    ...
886          887         0       2  ...        S          0      1
887          888         1       1  ...        S          0      1
888          889         0       3  ...        S          3      0
889          890         1       1  ...        C          0      1
890          891         0       3  ...        Q          0      1

[891 rows x 11 columns]>

####**Chance of surviving of the alone person**

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

####**The corelation of alone person and fare**

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000


####             The ticket price would have been higher if the person was not alone

*

####**Checking the Gender Prioritisation**

In [ ]:
df['Sex'] = [0 if df['Sex'][i] =='male' else 1 for i in df.index] #1 for female ,0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

#### The women were more prioritised than men

*

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

##**CONCLUSIONS**
* Family Size does'nt have correlance with the survival rate
* Passengers travelling alone would have less chance of suvival
* Passengers not travelling alone would have high ticket price
* Women were prioritised over men
* Passengers who bored ship at Cherbourg has more survival rate
* The richer people seemed to be saved as they have more survival rate